RESULTS_BARE/redis_docker_20251109-0033.txt
=== 2025-11-09 00:33:53 — workload=redis env=docker run=2/7 ===
$ memtier_benchmark -s 192.168.1.149 -p 6379 --ratio=1:10 -t 4 -c 50 -d 64 -n 500000
4         Threads
50        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         2174.62          ---          ---       175.50085         8.51100        26.75100        91.13500       235.48 
Gets        21746.01       100.75     21645.25       179.62946         8.51100        26.62300        91.13500       853.58 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      23920.63       100.75     21645.25       179.25412         8.51100        26.62300        91.13500      1089.06 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.423        0.000
SET       6.111        5.000
SET       7.455       10.000
SET       8.031       15.000
SET       8.255       20.000
SET       8.319       25.000
SET       8.383       30.000
SET       8.383       35.000
SET       8.447       40.000
SET       8.511       45.000
SET       8.511       50.000
SET       8.511       52.500
SET       8.575       55.000
SET       8.575       57.500
SET       8.575       60.000
SET       8.639       62.500
SET       8.639       65.000
SET       8.639       67.500
SET       8.703       70.000
SET       8.767       72.500
SET       8.767       75.000
SET       8.831       76.250
SET       8.831       77.500
SET       8.895       78.750
SET       9.023       80.000
SET       9.279       81.250
SET       9.535       82.500
SET       9.791       83.750
SET       9.983       85.000
SET      10.175       86.250
SET      10.303       87.500
SET      10.431       88.125
SET      10.495       88.750
SET      10.559       89.375
SET      10.623       90.000
SET      10.751       90.625
SET      10.815       91.250
SET      10.879       91.875
SET      11.007       92.500
SET      11.263       93.125
SET      11.711       93.750
SET      12.095       94.062
SET      12.415       94.375
SET      12.735       94.688
SET      12.927       95.000
SET      13.119       95.312
SET      13.183       95.625
SET      13.311       95.938
SET      13.439       96.250
SET      13.631       96.562
SET      14.079       96.875
SET      14.463       97.031
SET      14.847       97.188
SET      15.295       97.344
SET      15.679       97.500
SET      15.999       97.656
SET      16.255       97.812
SET      16.511       97.969
SET      17.023       98.125
SET      18.047       98.281
SET      19.199       98.438
SET      19.967       98.516
SET      20.735       98.594
SET      21.631       98.672
SET      22.655       98.750
SET      23.807       98.828
SET      25.087       98.906
SET      26.495       98.984
SET      28.287       99.062
SET      30.335       99.141
SET      33.023       99.219
SET      34.303       99.258
SET      35.839       99.297
SET      37.119       99.336
SET      38.655       99.375
SET      40.191       99.414
SET      41.983       99.453
SET      44.031       99.492
SET      46.591       99.531
SET      49.151       99.570
SET      51.455       99.609
SET      52.735       99.629
SET      54.015       99.648
SET      55.295       99.668
SET      56.831       99.688
SET      58.623       99.707
SET      60.927       99.727
SET      63.231       99.746
SET      66.047       99.766
SET      68.607       99.785
SET      70.655       99.805
SET      72.191       99.814
SET      73.727       99.824
SET      75.263       99.834
SET      77.311       99.844
SET      79.359       99.854
SET      81.407       99.863
SET      83.455       99.873
SET      86.015       99.883
SET      88.575       99.893
SET      91.647       99.902
SET      93.695       99.907
SET      96.255       99.912
SET      98.815       99.917
SET     101.887       99.922
SET     104.447       99.927
SET     108.031       99.932
SET     111.615       99.937
SET     115.711       99.941
SET     119.295       99.946
SET     124.415       99.951
SET     126.975       99.954
SET     130.559       99.956
SET     135.167       99.958
SET     139.263       99.961
SET     148.479       99.963
SET     156.671       99.966
SET     169.983       99.968
SET     249.855       99.971
SET    603979.750       99.973
SET    603979.750      100.000
---
GET       0.383        0.000
GET       6.111        5.000
GET       7.423       10.000
GET       8.031       15.000
GET       8.191       20.000
GET       8.319       25.000
GET       8.383       30.000
GET       8.383       35.000
GET       8.447       40.000
GET       8.511       45.000
GET       8.511       50.000
GET       8.511       52.500
GET       8.575       55.000
GET       8.575       57.500
GET       8.575       60.000
GET       8.639       62.500
GET       8.639       65.000
GET       8.639       67.500
GET       8.703       70.000
GET       8.703       72.500
GET       8.767       75.000
GET       8.831       76.250
GET       8.831       77.500
GET       8.895       78.750
GET       9.023       80.000
GET       9.215       81.250
GET       9.535       82.500
GET       9.791       83.750
GET       9.983       85.000
GET      10.175       86.250
GET      10.303       87.500
GET      10.431       88.125
GET      10.495       88.750
GET      10.559       89.375
GET      10.623       90.000
GET      10.687       90.625
GET      10.815       91.250
GET      10.879       91.875
GET      11.007       92.500
GET      11.199       93.125
GET      11.711       93.750
GET      12.095       94.062
GET      12.415       94.375
GET      12.735       94.688
GET      12.927       95.000
GET      13.055       95.312
GET      13.183       95.625
GET      13.311       95.938
GET      13.439       96.250
GET      13.631       96.562
GET      14.015       96.875
GET      14.399       97.031
GET      14.847       97.188
GET      15.295       97.344
GET      15.679       97.500
GET      15.999       97.656
GET      16.255       97.812
GET      16.511       97.969
GET      17.023       98.125
GET      18.047       98.281
GET      19.199       98.438
GET      19.839       98.516
GET      20.607       98.594
GET      21.503       98.672
GET      22.527       98.750
GET      23.679       98.828
GET      24.959       98.906
GET      26.367       98.984
GET      28.159       99.062
GET      30.207       99.141
GET      33.023       99.219
GET      34.303       99.258
GET      35.583       99.297
GET      37.119       99.336
GET      38.655       99.375
GET      40.191       99.414
GET      41.983       99.453
GET      44.031       99.492
GET      46.591       99.531
GET      49.151       99.570
GET      51.455       99.609
GET      52.735       99.629
GET      54.015       99.648
GET      55.551       99.668
GET      57.087       99.688
GET      58.879       99.707
GET      60.927       99.727
GET      63.487       99.746
GET      66.047       99.766
GET      68.607       99.785
GET      71.167       99.805
GET      72.191       99.814
GET      73.727       99.824
GET      75.775       99.834
GET      77.311       99.844
GET      79.359       99.854
GET      81.919       99.863
GET      83.967       99.873
GET      86.015       99.883
GET      88.575       99.893
GET      91.647       99.902
GET      94.207       99.907
GET      96.255       99.912
GET      99.327       99.917
GET     101.887       99.922
GET     104.959       99.927
GET     108.543       99.932
GET     112.127       99.937
GET     116.223       99.941
GET     119.807       99.946
GET     124.415       99.951
GET     127.487       99.954
GET     130.559       99.956
GET     135.167       99.958
GET     140.287       99.961
GET     149.503       99.963
GET     158.719       99.966
GET     173.055       99.968
GET     268.287       99.971
GET    603979.750       99.973
GET    603979.750      100.000
---
WAIT      0.000      100.000
=== end ===